package Sholkov.CreationalDesignPatterns.Singleton;

//Цель: гарантировать, что у класса будет только один экземпляр и к нему будет представлена глобальная точка доступа
//Применение: для содания единственного экземпляраопределённого класса
//Примеры:
//1. необходим только один экземпляр конкретного класса, который доступен для всех клиентов;
//2. единственный экземпляр должен наследоваться путём порождения подклассов, при этом клиенты имеют возможность работать
//с классом-наследником без модификации своего кода.

public class Main {
    public static void main(String[] args) {
//        Randoming.getRandoming().addChoiceInfo("Your choice " + );
    }
}
